artillery/all-fields.yaml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 240
      arrivalRate: 25
  plugins:
    publish-metrics:
      - type: prometheus
        pushgateway: "http://localhost:9091"
        tags:
          - "type:all-fields-scenario"

scenarios:
  - name: "Query to retrieve all information"
    flow:
      - post:
          url: "/graphql"
          json:
            query: |
              query carByPlates($licencePlate: ID!){
                carByLicencePlate(licencePlate: $licencePlate){
                  description
                  driver {
                    firstName
                    lastName
                    penalties {
                      points
                      car {
                        licencePlate
                        description
                      }
                      violationType
                    }
                    activePenaltyPoints
                  }
                }
              }
            variables:
              licencePlate: "{{ $randomString() }}"